""" Задача уровня  elementary c сайта https://py.checkio.org.
You are given a string and you have to find its first word.
"""
str_ = "Hello World"
word = str_.split()  # делим строку на слова
print(word[0])       # выводим первое слово
