#Напишите функцию, которая принимает имя и фамилию, и выводит
#приветственное сообщение с обращением по инициалам.

def name(a,b):
  print(a,b)

  a = input("your name")
  b = print("Hello",a)

name(a,b)