# Дан список стран и городов каждой страны. Затем даны названия городов.
# Для каждого города укажите, в какой стране он находится.
# Входные данные
# Программа получает на вход количество стран N.
# Далее идет N строк, каждая строка начинается с названия страны,
# затем идут названия городов этой страны. В следующей строке записано число M,
# далее идут M запросов — названия каких-то M городов, перечисленных выше.
# Выходные данные
# Для каждого из запроса выведите название страны, в котором находится данный город.
n = int(input("Введите количество строк"))
country_cities = {}
for _ in range(n):
    a, *b = input("Введите страну и города ").split()
    country_cities[a] = b
m = int(input("Введите количество строк"))
for _ in range(m):
    city = (input("Введите город"))
    for country, cities in country_cities.items():
        if city in cities:
            print(country)
